Revit 2021.1 API
AnalysisMode Enumeration
 This enum is used to define the Energy Analysis Model.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2016
Syntax
C#
public enum AnalysisMode
Visual Basic
Public Enumeration AnalysisMode
Visual C++
public enum class AnalysisMode
Members
Member name | Description
BuildingElements |  Energy Analysis Model based on building elements.
ConceptualMasses |  Energy Analysis Model based on conceptual masses.
ConceptualMassesAndBuildingElements |  Energy Analysis Model based on conceptual masses and building elements.
See Also
Autodesk.Revit.DB.Analysis Namespace